# Pandas - a quick introduction

In this tutorial, we'll explore pandas, the Python data analysis toolkit. Our emphasis will be on working with dataframes, the primary pandas object. Although we don't have time to study all the features of dataframes, extensive documentation can be found here https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html

Let's dive into an Olympic Medal dataset available from Wikipedia https://en.wikipedia.org/wiki/All-time_Olympic_Games_medal_table. I've already done a little bit of cleanup so that we can quickly get to the important features.

In [1]:
import pandas as pd

Our file is in csv format, so we'll use the read_csv method. We know that the first two rows contain comments and other data that we won't want. We can use the skiprows argument to skip over these rows. We'll set index_col to zero so that the first column serves and the index.

In [2]:
df = pd.read_csv('olympics.csv', index_col=0, skiprows=2)

In [3]:
df.head()

,Summer games,Summer gold,Summer silver,Summer bronze,Summer total,Winter games,Winter gold,Winter silver,Winter bronze,Winter total,Combined games,Combined gold,Combined silver,Combined bronze,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [4]:
df.tail()

,Summer games,Summer gold,Summer silver,Summer bronze,Summer total,Winter games,Winter gold,Winter silver,Winter bronze,Winter total,Combined games,Combined gold,Combined silver,Combined bronze,Combined total
Independent Olympic Participants (IOP) [IOP],1,0,1,2,3,0,0,0,0,0,1,0,1,2,3
Zambia (ZAM) [ZAM],12,0,1,1,2,0,0,0,0,0,12,0,1,1,2
Zimbabwe (ZIM) [ZIM],12,3,4,1,8,1,0,0,0,0,13,3,4,1,8
Mixed team (ZZX) [ZZX],3,8,5,4,17,0,0,0,0,0,3,8,5,4,17
Totals,27,4809,4775,5130,14714,22,959,958,948,2865,49,5768,5733,6078,17579

Note that the last row of our dataframe contains totals for the number of games and medals won. Let's get rid of that using the drop method.

In [5]:
df = df.drop('Totals')
df.tail()

,Summer games,Summer gold,Summer silver,Summer bronze,Summer total,Winter games,Winter gold,Winter silver,Winter bronze,Winter total,Combined games,Combined gold,Combined silver,Combined bronze,Combined total
Yugoslavia (YUG) [YUG],16,26,29,28,83,14,0,3,1,4,30,26,32,29,87
Independent Olympic Participants (IOP) [IOP],1,0,1,2,3,0,0,0,0,0,1,0,1,2,3
Zambia (ZAM) [ZAM],12,0,1,1,2,0,0,0,0,0,12,0,1,1,2
Zimbabwe (ZIM) [ZIM],12,3,4,1,8,1,0,0,0,0,13,3,4,1,8
Mixed team (ZZX) [ZZX],3,8,5,4,17,0,0,0,0,0,3,8,5,4,17

We can manipulate the data in our data frame. For example, let's cleanup the country names to get rid of everything from the country abbreviation to the end of the string. For example "Australia (AUS) [AUS] [Z]" becomes simply "Australia".

We'll start by calling the str.split method to split the country names on the opening parenthesis "(" and then reassign the first element of the resulting list to the index. We then display the head of the dataframe to confirm that the renaming of the countries worked as expected.

In [6]:
names_ids = df.index.str.split('\s\(')
df.index = names_ids.str[0]
df.head()

,Summer games,Summer gold,Summer silver,Summer bronze,Summer total,Winter games,Winter gold,Winter silver,Winter bronze,Winter total,Combined games,Combined gold,Combined silver,Combined bronze,Combined total
Afghanistan,13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria,12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina,23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia,5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia,2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

The columns attribute returns the column names. Note that we don't return the first column, which was already assigned as the index.

In [7]:
df.columns

Index(['Summer games', 'Summer gold', 'Summer silver', 'Summer bronze',
       'Summer total', 'Winter games', 'Winter gold', 'Winter silver',
       'Winter bronze', 'Winter total', 'Combined games', 'Combined gold',
       'Combined silver', 'Combined bronze', 'Combined total'],
      dtype='object')

Rows are accessed by row number using the iloc. In the example below, we pull out the data for Argentina

In [8]:
df.iloc[2]

Summer games       23
Summer gold        18
Summer silver      24
Summer bronze      28
Summer total       70
Winter games       18
Winter gold         0
Winter silver       0
Winter bronze       0
Winter total        0
Combined games     41
Combined gold      18
Combined silver    24
Combined bronze    28
Combined total     70
Name: Argentina, dtype: int64

We can also access a row by the label or value of the index. For example, if we wanted to get the data for France, it's more convenient to use the label than figure out the row number.

In [9]:
df.loc['France']

Summer games        27
Summer gold        202
Summer silver      223
Summer bronze      246
Summer total       671
Winter games        22
Winter gold         31
Winter silver       31
Winter bronze       47
Winter total       109
Combined games      49
Combined gold      233
Combined silver    254
Combined bronze    293
Combined total     780
Name: France, dtype: int64

Columns are accessed using the column names. In the example below, we return a series containing the number of summer gold medals by country.

In [10]:
df['Summer silver'].head()

Afghanistan     0
Algeria         2
Argentina      24
Armenia         2
Australasia     4
Name: Summer silver, dtype: int64

We can select multiple columns from a dataframe by passing a list of column names rather than a single name

In [11]:
df[['Summer gold', 'Summer silver', 'Summer bronze']].head()

             Summer gold  Summer silver  Summer bronze
Afghanistan            0              0              2
Algeria                5              2              8
Argentina             18             24             28
Armenia                1              2              9
Australasia            3              4              5

If we just want the index, this is accessed using the index attribute

In [12]:
df.index

Index(['Afghanistan', 'Algeria', 'Argentina', 'Armenia', 'Australasia',
       'Australia', 'Austria', 'Azerbaijan', 'Bahamas', 'Bahrain',
       ...
       'Uruguay', 'Uzbekistan', 'Venezuela', 'Vietnam', 'Virgin Islands',
       'Yugoslavia', 'Independent Olympic Participants', 'Zambia', 'Zimbabwe',
       'Mixed team'],
      dtype='object', length=146)

We can add columns to our dataframe. For example, we'll calculate a weighted total for combined medals where gold=3, silver=2 and bronze=1.

In [13]:
df['Combined weighted'] = df['Combined gold']*3 + df['Combined silver']*2 + df['Combined bronze']

In [14]:
df['Combined weighted'].head()

Afghanistan      2
Algeria         27
Argentina      130
Armenia         16
Australasia     22
Name: Combined weighted, dtype: int64

Pandas provides methods for finding min and max values and the corresponding index. Below, we find the country that won the most winter gold medals and the number that they won.

In [15]:
print(df['Winter gold'].max())
print(df['Winter gold'].idxmax())

118
Norway

We can select rows from the dataframe based on the values in a column. In the example below, we filter on countries that have won at least 50 gold medals in the winter Olympics.

In [16]:
df.loc[ df['Winter gold']>50 ]

,Summer games,Summer gold,Summer silver,Summer bronze,Summer total,Winter games,Winter gold,Winter silver,Winter bronze,Winter total,Combined games,Combined gold,Combined silver,Combined bronze,Combined total,Combined weighted
Austria,26,18,33,35,86,22,59,78,81,218,48,77,111,116,304,569
Canada,25,59,99,121,279,22,62,56,52,170,47,121,155,173,449,846
Germany,15,174,182,217,573,11,78,78,53,209,26,252,260,270,782,1546
Norway,24,56,49,43,148,22,118,111,100,329,46,174,160,143,477,985
Soviet Union,9,395,319,296,1010,9,78,57,59,194,18,473,376,355,1204,2526
United States,26,976,757,666,2399,22,96,102,84,282,48,1072,859,750,2681,5684

We can filter on multiple columns. In the example below, we limit the output to countries that also won more than 50 summer gold medals and assign the results to a new dataframe

In [17]:
df2 = df.loc[ (df['Winter gold']>50) & (df['Summer gold']>50) ]
df2

,Summer games,Summer gold,Summer silver,Summer bronze,Summer total,Winter games,Winter gold,Winter silver,Winter bronze,Winter total,Combined games,Combined gold,Combined silver,Combined bronze,Combined total,Combined weighted
Canada,25,59,99,121,279,22,62,56,52,170,47,121,155,173,449,846
Germany,15,174,182,217,573,11,78,78,53,209,26,252,260,270,782,1546
Norway,24,56,49,43,148,22,118,111,100,329,46,174,160,143,477,985
Soviet Union,9,395,319,296,1010,9,78,57,59,194,18,473,376,355,1204,2526
United States,26,976,757,666,2399,22,96,102,84,282,48,1072,859,750,2681,5684

Let's create a simpler dataframe that is limited to the gold medal results and then use the sum method to sum the values in a column.

In [18]:
df2 = df2[['Summer gold', 'Winter gold']]
df2

               Summer gold  Winter gold
Canada                  59           62
Germany                174           78
Norway                  56          118
Soviet Union           395           78
United States          976           96

In [19]:
df2['Winter gold'].sum()

432

## Missing values

Observation data often has missing values, which can lead to problems with their analysis. Fortunately, pandas provides fillna and interpolate methods for filling in these missing values (data imputation)

Let's explore this using a small data set containing temperatures in US cities over the course of a week.

In [20]:
# Missing values are dislayed as NaNs (Not a Number)
df3 = pd.read_csv('city temps.csv', index_col=0, skiprows=0)
df3

           Sunday  Monday  Tuesday  Wednesday  Thursday  Friday  Saturday
New York     71.0     NaN     75.0       78.0      80.0    81.0      79.0
Boston       58.0    56.0      NaN       54.0      50.0    61.0      63.0
Dallas       92.0    91.0     90.0        NaN       NaN    85.0      82.0
San Diego    72.0    72.0     72.0       70.0       NaN    71.0      68.0
Seattle      61.0    63.0     61.0        NaN      60.0    61.0      68.0

In [21]:
# The simplest method is to replace missing values with a fixed value
df3.fillna(value=70)

           Sunday  Monday  Tuesday  Wednesday  Thursday  Friday  Saturday
New York     71.0    70.0     75.0       78.0      80.0    81.0      79.0
Boston       58.0    56.0     70.0       54.0      50.0    61.0      63.0
Dallas       92.0    91.0     90.0       70.0      70.0    85.0      82.0
San Diego    72.0    72.0     72.0       70.0      70.0    71.0      68.0
Seattle      61.0    63.0     61.0       70.0      60.0    61.0      68.0

In [22]:
# Forward filling using the last valid value to fill missing value
# Note that in this case we used axis=1 so that we propogate across
# the rows rather than the values

df3.fillna(method="ffill", axis=1)

           Sunday  Monday  Tuesday  Wednesday  Thursday  Friday  Saturday
New York     71.0    71.0     75.0       78.0      80.0    81.0      79.0
Boston       58.0    56.0     56.0       54.0      50.0    61.0      63.0
Dallas       92.0    91.0     90.0       90.0      90.0    85.0      82.0
San Diego    72.0    72.0     72.0       70.0      70.0    71.0      68.0
Seattle      61.0    63.0     61.0       61.0      60.0    61.0      68.0

In [23]:
# Back filling using the NEXT valid value to fill missing value
# Note that in this case we used axis=1 so that we propogate across
# the rows rather than the values

df3.fillna(method="bfill", axis=1)

           Sunday  Monday  Tuesday  Wednesday  Thursday  Friday  Saturday
New York     71.0    75.0     75.0       78.0      80.0    81.0      79.0
Boston       58.0    56.0     54.0       54.0      50.0    61.0      63.0
Dallas       92.0    91.0     90.0       85.0      85.0    85.0      82.0
San Diego    72.0    72.0     72.0       70.0      71.0    71.0      68.0
Seattle      61.0    63.0     61.0       60.0      60.0    61.0      68.0

In [24]:
# As of version 0.17.0, pandas provides an interpolate function that fills missing values
# By default, we get a linear interpolation, but a number of other options are available
# (quadratic, cubic, polynomial, etc.)

df3.interpolate(method="linear", axis=1)

           Sunday  Monday  Tuesday  Wednesday   Thursday  Friday  Saturday
New York     71.0    73.0     75.0  78.000000  80.000000    81.0      79.0
Boston       58.0    56.0     55.0  54.000000  50.000000    61.0      63.0
Dallas       92.0    91.0     90.0  88.333333  86.666667    85.0      82.0
San Diego    72.0    72.0     72.0  70.000000  70.500000    71.0      68.0
Seattle      61.0    63.0     61.0  60.500000  60.000000    61.0      68.0

## Data formats

Until now, we've been working with csv files, but pandas can handle many other formats including json, html, excel and HDF. This is extremely useful since we don't need to create csv files from richer data formats. We show an example below where we read two sheets from an Excel file

In [25]:
df4 = pd.read_excel('city temps spreadsheet.xlsx', index_col=0, skiprows=0, sheet_name='set1')
df4

           Sunday  Monday  Tuesday  Wednesday  Thursday  Friday  Saturday
New York       71     NaN     75.0       78.0      80.0      81        79
Boston         58    56.0      NaN       54.0      50.0      61        63
Dallas         92    91.0     90.0        NaN       NaN      85        82
San Diego      72    72.0     72.0       70.0       NaN      71        68
Seattle        61    63.0     61.0        NaN      60.0      61        68

In [26]:
df5 = pd.read_excel('city temps spreadsheet.xlsx', index_col=0, skiprows=0, sheet_name='set2')
df5

           Sunday  Monday  Tuesday  Wednesday  Thursday  Friday  Saturday
Atlanta        71     NaN     75.0       78.0      80.0      81        79
Portland       58    56.0      NaN       54.0      50.0      61        63
Phoenix        92    91.0     90.0        NaN       NaN      85        82
Las Vegas      72    72.0     72.0       70.0       NaN      71        68
Chicago        61    63.0     61.0        NaN      60.0      61        68